# Dados Absolutos e relativos

In [1]:
import pandas as pd
import numpy as np

## Percentuais

In [2]:
dados = {'emprego': ['Administrador_banco_dados', 'Programador', 'Arquiteto_redes'],
         'nova_jersey': [97350, 87080, 112840],
         'florida':[77140, 71540,62310]}
dados = pd.DataFrame(dados)
dados

                     emprego  nova_jersey  florida
0  Administrador_banco_dados        97350    77140
1                Programador        87080    71540
2            Arquiteto_redes       112840    62310

In [3]:
dados['%_nova_jersey'] = (dados['nova_jersey']/dados['nova_jersey'].sum()) * 100
dados['%_florida'] = (dados['florida']/dados['florida'].sum()) * 100
dados

                     emprego  nova_jersey  florida  %_nova_jersey  %_florida
0  Administrador_banco_dados        97350    77140      32.748007  36.560974
1                Programador        87080    71540      29.293235  33.906820
2            Arquiteto_redes       112840    62310      37.958758  29.532205

## EXERCICIO 1 - percentuais

In [4]:
df_census = pd.read_csv('Bases de dados/census.csv')
print(df_census.shape)
df_census.head()

(32561, 15)

,age,workclass,final-weight,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loos,hour-per-week,native-country,income
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [7]:
dataset_ex1 = df_census[['education', 'income']]
dataset_ex1.head()

    education  income
0   Bachelors   <=50K
1   Bachelors   <=50K
2     HS-grad   <=50K
3        11th   <=50K
4   Bachelors   <=50K

In [27]:
dataset_ex1[dataset_ex1['income']==' <=50K'].value_counts()

education      income
 HS-grad        <=50K    8826
 Some-college   <=50K    5904
 Bachelors      <=50K    3134
 11th           <=50K    1115
 Assoc-voc      <=50K    1021
 10th           <=50K     871
 Assoc-acdm     <=50K     802
 Masters        <=50K     764
 7th-8th        <=50K     606
 9th            <=50K     487
 12th           <=50K     400
 5th-6th        <=50K     317
 1st-4th        <=50K     162
 Prof-school    <=50K     153
 Doctorate      <=50K     107
 Preschool      <=50K      51
dtype: int64

In [28]:
dataset_ex1[dataset_ex1['income']==' >50K'].value_counts()

education      income
 Bachelors      >50K     2221
 HS-grad        >50K     1675
 Some-college   >50K     1387
 Masters        >50K      959
 Prof-school    >50K      423
 Assoc-voc      >50K      361
 Doctorate      >50K      306
 Assoc-acdm     >50K      265
 10th           >50K       62
 11th           >50K       60
 7th-8th        >50K       40
 12th           >50K       33
 9th            >50K       27
 5th-6th        >50K       16
 1st-4th        >50K        6
dtype: int64

In [64]:
#dataset_ex1.groupby(['income','education']).size().reset_index(name='counts')
dataset_ex1.groupby(['income','education']).size()

income  education
 <=50K   10th             871
         11th            1115
         12th             400
         1st-4th          162
         5th-6th          317
         7th-8th          606
         9th              487
         Assoc-acdm       802
         Assoc-voc       1021
         Bachelors       3134
         Doctorate        107
         HS-grad         8826
         Masters          764
         Preschool         51
         Prof-school      153
         Some-college    5904
 >50K    10th              62
         11th              60
         12th              33
         1st-4th            6
         5th-6th           16
         7th-8th           40
         9th               27
         Assoc-acdm       265
         Assoc-voc        361
         Bachelors       2221
         Doctorate        306
         HS-grad         1675
         Masters          959
         Prof-school      423
         Some-college    1387
dtype: int64

## EXERCICIO 2 - Indices

In [76]:
dataset = {'ano_graduacao':['1º','2º','3º','4º'], 
           'matriculas_marco':[70, 50, 47, 23],
           'matriculas_novembro':[65,48,40,22]}
dataset = pd.DataFrame(dataset)
dataset = dataset.set_index('ano_graduacao')
dataset

               matriculas_marco  matriculas_novembro
ano_graduacao
1º                           70                   65
2º                           50                   48
3º                           47                   40
4º                           23                   22

In [77]:
dataset['%_taxa_evasao'] = round(((dataset['matriculas_marco'] - dataset['matriculas_novembro'])/dataset['matriculas_marco'])*100,2)
dataset

               matriculas_marco  matriculas_novembro  %_taxa_evasao
ano_graduacao
1º                           70                   65           7.14
2º                           50                   48           4.00
3º                           47                   40          14.89
4º                           23                   22           4.35